In [50]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import plotly.express as px
import seaborn as sns
from mod.unique_value import checking_unique_value

# Change in Mean Sea Levels

In [51]:
change_in_mean_sea_level_df = pd.read_csv('./Change_in_Mean_Sea_Levels.csv')
change_in_mean_sea_level_df = pd.DataFrame(change_in_mean_sea_level_df)
change_in_mean_sea_level_df.head()

,ObjectId,Country,ISO2,ISO3,Indicator,Unit,Source,CTS_Code,CTS_Name,CTS_Full_Descriptor,Measure,Date,Value
0,1,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Andaman Sea,D12/17/1992,-10.34
1,2,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Arabian Sea,D12/17/1992,-18.46
2,3,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Atlantic Ocean,D12/17/1992,-15.41
3,4,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Baltic Sea,D12/17/1992,196.85
4,5,World,NaN,WLD,Change in mean sea level: Sea level: TOPEX.Pos...,Millimeters,National Oceanic and Atmospheric Administratio...,ECCL,Change in Mean Sea Level,"Environment, Climate Change, Climate Indicator...",Bay Bengal,D12/17/1992,3.27

In [52]:
change_in_mean_sea_level_df.columns

Index(['ObjectId', 'Country', 'ISO2', 'ISO3', 'Indicator', 'Unit', 'Source',
       'CTS_Code', 'CTS_Name', 'CTS_Full_Descriptor', 'Measure', 'Date',
       'Value'],
      dtype='object')

In [53]:
change_in_mean_sea_level_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35604 entries, 0 to 35603
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ObjectId             35604 non-null  int64
 1   Country              35604 non-null  object
 2   ISO2                 0 non-null      float64
 3   ISO3                 35604 non-null  object
 4   Indicator            35604 non-null  object
 5   Unit                 35604 non-null  object
 6   Source               35604 non-null  object
 7   CTS_Code             35604 non-null  object
 8   CTS_Name             35604 non-null  object
 9   CTS_Full_Descriptor  35604 non-null  object
 10  Measure              35604 non-null  object
 11  Date                 35604 non-null  object
 12  Value                35604 non-null  float64
dtypes: float64(2), int64(1), object(10)
memory usage: 3.5+ MB

In [54]:
change_in_mean_sea_level_df.describe().round(2)

       ObjectId  ISO2     Value
count  35604.00   0.0  35604.00
mean   17802.50   NaN     25.98
std    10278.13   NaN     62.78
min        1.00   NaN   -401.85
25%     8901.75   NaN     -8.55
50%    17802.50   NaN     23.10
75%    26703.25   NaN     58.48
max    35604.00   NaN    504.95

In [55]:
checking_unique_value(change_in_mean_sea_level_df)

Unique values in column 'ObjectId': 35604
Unique values in column 'Country': 1
Unique values in column 'ISO2': 0
Unique values in column 'ISO3': 1
Unique values in column 'Indicator': 5
Unique values in column 'Unit': 1
Unique values in column 'Source': 1
Unique values in column 'CTS_Code': 1
Unique values in column 'CTS_Name': 1
Unique values in column 'CTS_Full_Descriptor': 1
Unique values in column 'Measure': 25
Unique values in column 'Date': 3653
Unique values in column 'Value': 16831

In [56]:
columns_to_drop = ['ObjectId', 'Country', 'ISO2', 'ISO3', 'Unit', 'Source', 'CTS_Code', 'CTS_Name', 'CTS_Full_Descriptor']
df = change_in_mean_sea_level_df.drop(columns=columns_to_drop, axis='columns')

In [57]:
df.head()

,Indicator,Measure,Date,Value
0,Change in mean sea level: Sea level: TOPEX.Pos...,Andaman Sea,D12/17/1992,-10.34
1,Change in mean sea level: Sea level: TOPEX.Pos...,Arabian Sea,D12/17/1992,-18.46
2,Change in mean sea level: Sea level: TOPEX.Pos...,Atlantic Ocean,D12/17/1992,-15.41
3,Change in mean sea level: Sea level: TOPEX.Pos...,Baltic Sea,D12/17/1992,196.85
4,Change in mean sea level: Sea level: TOPEX.Pos...,Bay Bengal,D12/17/1992,3.27

In [58]:
df['Date'] = df['Date'].apply(lambda x: x[1:])
#df = df.groupby('Date')
df.shape

(35604, 4)

In [59]:
df.head()

,Indicator,Measure,Date,Value
0,Change in mean sea level: Sea level: TOPEX.Pos...,Andaman Sea,12/17/1992,-10.34
1,Change in mean sea level: Sea level: TOPEX.Pos...,Arabian Sea,12/17/1992,-18.46
2,Change in mean sea level: Sea level: TOPEX.Pos...,Atlantic Ocean,12/17/1992,-15.41
3,Change in mean sea level: Sea level: TOPEX.Pos...,Baltic Sea,12/17/1992,196.85
4,Change in mean sea level: Sea level: TOPEX.Pos...,Bay Bengal,12/17/1992,3.27